<?php


// Необходимо создать класс "Фигура". От данного класса наследовать 3 класса двумерных фигур (например, квадрат, треугольник, окружность и т.д.). Все свойства должны быть приватными.

// После создания структуры классов, необходимо реализовать простое REST API. То есть ваша задача - создать одну страницу, которая принимает запросы в том виде, в каком вы сами опишите. Суть данной API: По входным данным считать площадь/периметр/объем.В файлике README нужно описать как работать с вашей API, то есть нужна информация:

// Точка входа (url относительно корня сайта)

// Метод HTTP-запроса

// Параметры: фигура, необходимые данные для фигуры (сторона, радиус и т.д.), метод (площадь, периметр)

// Формат ответа
